openfoam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMultiMotionSolverFvMesh;
motionSolver multiSolidBodyMotionSolver;
motionSolverLibs ("libdynamicMesh.so");

rotation1
{
    solidBodyMotionFunction  controlledRotatingMotion;
    controlledRotatingMotionCoeffs
    {
        origin        (0.25 0 0);
		axis          (0 0 1);
		omega         1;// rad/s, 1rad/s=9.5rpm
    }
}


dynamicMultiMotionSolverFvMeshCoeffs
{
	
	rotate_wholeDomain
    {
        cellZone c0;
        // Solve displacement on top of solid-body rotation
        solver solidBodyDisplacementLaplacian;

        solidBodyDisplacementLaplacianCoeffs
        {
            solidBodyMotionFunction  multiMotion;
            multiMotionCoeffs
            {
                rotationMotion
                {
                    $rotation1;
                }

            }
            diffusivity inverseDistance (top);// AMI1_inner AMI2_inner AMI1_outer AMI2_outer c
		//	  diffusivity uniform;

        }
    }
}


// ************************************************************************* //

